app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["email", "test"], ["created_at", "2018-02-26 12:32:58.277457"], ["updated_at", "2018-02-26 12:32:58.277457"]]